Ceph/study_compaction/qd48-120s-default-test-perfon/.ipynb_checkpoints/dump_fio_result-checkpoint
fio-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=rbd, iodepth=48
fio-3.19-52-gb2ed
Starting 1 process

fio-write: (groupid=0, jobs=1): err= 0: pid=30505: Tue May 12 08:50:30 2020
  write: IOPS=6305, BW=24.6MiB/s (25.8MB/s)(2965MiB/120391msec); 0 zone resets
    slat (nsec): min=746, max=790751, avg=3212.18, stdev=3268.48
    clat (usec): min=735, max=6121.3k, avg=7607.52, stdev=119942.39
     lat (usec): min=746, max=6121.3k, avg=7610.74, stdev=119942.45
    clat percentiles (usec):
     |  1.00th=[   1467],  5.00th=[   2089], 10.00th=[   2507],
     | 20.00th=[   2835], 30.00th=[   3032], 40.00th=[   3163],
     | 50.00th=[   3326], 60.00th=[   3458], 70.00th=[   3654],
     | 80.00th=[   3916], 90.00th=[   4555], 95.00th=[   5276],
     | 99.00th=[   7046], 99.50th=[   8225], 99.90th=[2969568],
     | 99.95th=[3238003], 99.99th=[4731175]
   bw (  KiB/s): min=  432, max=58928, per=100.00%, avg=39952.68, stdev=19840.17, samples=152
   iops        : min=  108, max=14732, avg=9988.17, stdev=4960.04, samples=152
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=4.27%, 4=77.43%, 10=17.96%, 20=0.14%, 50=0.02%
  lat (msec)   : 100=0.02%, 250=0.04%, 500=0.01%, 2000=0.01%, >=2000=0.12%
  cpu          : usr=5.79%, sys=3.39%, ctx=551864, majf=0, minf=3979
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,759149,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=48

Run status group 0 (all jobs):
  WRITE: bw=24.6MiB/s (25.8MB/s), 24.6MiB/s-24.6MiB/s (25.8MB/s-25.8MB/s), io=2965MiB (3109MB), run=120391-120391msec

Disk stats (read/write):
  sda: ios=8906/7487, merge=147/198767, ticks=75620/434308, in_queue=551188, util=53.41%